# ML_PROJECT

# Salary Prediction 

## based on features like (Age	,Gender	,Education Level,Job Title,Years of Experience)

.

In [1]:
import pandas as pd
import numpy as np

## Reading CSV file (salary_data)

In [2]:
salary = pd.read_csv("salary_data.csv")

In [3]:
salary

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [4]:
salary.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [5]:
salary.shape

(375, 6)

In [6]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  373 non-null    float64
 1   Gender               373 non-null    object
 2   Education Level      373 non-null    object
 3   Job Title            373 non-null    object
 4   Years of Experience  373 non-null    float64
 5   Salary               373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 17.7+ KB

In [7]:
salary.describe()

              Age  Years of Experience         Salary
count  373.000000           373.000000     373.000000
mean    37.431635            10.030831  100577.345845
std      7.069073             6.557007   48240.013482
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
print(salary['Gender'].unique())

['Male' 'Female' nan]

In [10]:
print(salary['Education Level'].unique())

["Bachelor's" "Master's" 'PhD' nan]

In [11]:
print(salary['Job Title'].unique())

['Software Engineer' 'Data Analyst' 'Senior Manager' 'Sales Associate'
 'Director' 'Marketing Analyst' 'Product Manager' 'Sales Manager'
 'Marketing Coordinator' 'Senior Scientist' 'Software Developer'
 'HR Manager' 'Financial Analyst' 'Project Manager' 'Customer Service Rep'
 'Operations Manager' 'Marketing Manager' 'Senior Engineer'
 'Data Entry Clerk' 'Sales Director' 'Business Analyst' 'VP of Operations'
 'IT Support' 'Recruiter' 'Financial Manager' 'Social Media Specialist'
 'Software Manager' 'Junior Developer' 'Senior Consultant'
 'Product Designer' 'CEO' 'Accountant' 'Data Scientist'
 'Marketing Specialist' 'Technical Writer' 'HR Generalist'
 'Project Engineer' 'Customer Success Rep' 'Sales Executive' 'UX Designer'
 'Operations Director' 'Network Engineer' 'Administrative Assistant'
 'Strategy Consultant' 'Copywriter' 'Account Manager'
 'Director of Marketing' 'Help Desk Analyst' 'Customer Service Manager'
 'Business Intelligence Analyst' 'Event Coordinator' 'VP of Finance'
 'Graphic Designer' 'UX Researcher' 'Social Media Manager'
 'Director of Operations' 'Senior Data Scientist' 'Junior Accountant'
 'Digital Marketing Manager' 'IT Manager'
 'Customer Service Representative' 'Business Development Manager'
 'Senior Financial Analyst' 'Web Developer' 'Research Director'
 'Technical Support Specialist' 'Creative Director'
 'Senior Software Engineer' 'Human Resources Director'
 'Content Marketing Manager' 'Technical Recruiter' 'Sales Representative'
 'Chief Technology Officer' 'Junior Designer' 'Financial Advisor'
 'Junior Account Manager' 'Senior Project Manager' 'Principal Scientist'
 'Supply Chain Manager' 'Senior Marketing Manager' 'Training Specialist'
 'Research Scientist' 'Junior Software Developer'
 'Public Relations Manager' 'Operations Analyst'
 'Product Marketing Manager' 'Senior HR Manager' 'Junior Web Developer'
 'Senior Project Coordinator' 'Chief Data Officer'
 'Digital Content Producer' 'IT Support Specialist'
 'Senior Marketing Analyst' 'Customer Success Manager'
 'Senior Graphic Designer' 'Software Project Manager'
 'Supply Chain Analyst' 'Senior Business Analyst'
 'Junior Marketing Analyst' 'Office Manager' 'Principal Engineer'
 'Junior HR Generalist' 'Senior Product Manager'
 'Junior Operations Analyst' 'Senior HR Generalist'
 'Sales Operations Manager' 'Senior Software Developer'
 'Junior Web Designer' 'Senior Training Specialist'
 'Senior Research Scientist' 'Junior Sales Representative'
 'Junior Marketing Manager' 'Junior Data Analyst'
 'Senior Product Marketing Manager' 'Junior Business Analyst'
 'Senior Sales Manager' 'Junior Marketing Specialist'
 'Junior Project Manager' 'Senior Accountant' 'Director of Sales'
 'Junior Recruiter' 'Senior Business Development Manager'
 'Senior Product Designer' 'Junior Customer Support Specialist'
 'Senior IT Support Specialist' 'Junior Financial Analyst'
 'Senior Operations Manager' 'Director of Human Resources'
 'Junior Software Engineer' 'Senior Sales Representative'
 'Director of Product Management' 'Junior Copywriter'
 'Senior Marketing Coordinator' 'Senior Human Resources Manager'
 'Junior Business Development Associate' 'Senior Account Manager'
 'Senior Researcher' 'Junior HR Coordinator' 'Director of Finance'
 'Junior Marketing Coordinator' nan 'Junior Data Scientist'
 'Senior Operations Analyst' 'Senior Human Resources Coordinator'
 'Senior UX Designer' 'Junior Product Manager'
 'Senior Marketing Specialist' 'Senior IT Project Manager'
 'Senior Quality Assurance Analyst' 'Director of Sales and Marketing'
 'Senior Account Executive' 'Director of Business Development'
 'Junior Social Media Manager' 'Senior Human Resources Specialist'
 'Senior Data Analyst' 'Director of Human Capital'
 'Junior Advertising Coordinator' 'Junior UX Designer'
 'Senior Marketing Director' 'Senior IT Consultant'
 'Senior Financial Advisor' 'Junior Business Operations Analyst'
 'Junior Social Media Specialist' 'Senior Product Development Manager'
 'Junior Operations Manager' 'Senior Software Architect'
 'Junior Research Scientist' 'Senior Financial Manager'
 'Senior HR Specialist' 'Senior Data Engineer'
 'Junior Operations Coordinator' 'Director of HR'
 'Senior Operations Coordinator' 'Junior Financial Advisor'
 'Director of Engineering']

In [12]:
salary["Job Title"].value_counts()

Director of Marketing              12
Director of Operations             11
Senior Business Analyst            10
Senior Marketing Analyst            9
Senior Marketing Manager            9
                                   ..
Business Development Manager        1
Customer Service Representative     1
IT Manager                          1
Digital Marketing Manager           1
Junior Web Developer                1
Name: Job Title, Length: 174, dtype: int64

In [13]:
salary.dropna(inplace=True)
salary.drop_duplicates()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
348,28.0,Female,Bachelor's,Junior Operations Manager,1.0,35000.0
349,36.0,Male,Bachelor's,Senior Business Development Manager,8.0,110000.0
350,44.0,Female,PhD,Senior Data Scientist,16.0,160000.0
351,31.0,Male,Bachelor's,Junior Marketing Coordinator,3.0,55000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0

In [14]:
g_LE= LabelEncoder()
salary['Gender']=g_LE.fit_transform(salary['Gender'])


e_LE = LabelEncoder()
salary['Education Level'] = e_LE.fit_transform(salary['Education Level'])


j_EC = LabelEncoder()
salary['Job Title']=j_EC.fit_transform(salary['Job Title'])

In [15]:
print(salary['Gender'].unique())

[1 0]

In [16]:
print(salary['Age'].unique())

[32. 28. 45. 36. 52. 29. 42. 31. 26. 38. 48. 35. 40. 27. 44. 33. 39. 25.
 51. 34. 47. 30. 41. 37. 24. 43. 50. 46. 49. 23. 53.]

In [17]:
print(salary['Years of Experience'].unique())

[ 5.   3.  15.   7.  20.   2.  12.   4.   1.  10.  18.   6.  14.  16.
  0.  22.  19.   9.  13.  11.  25.  21.   8.  17.  23.  24.   0.5  1.5]

In [18]:
print(salary['Education Level'].unique())

[0 1 2]

In [19]:
print(salary['Job Title'].unique())

[159  17 130 101  22  81  93 104  82 150 158  40  36  96  13  89  83 116
  18 102   3 172  44  98  37 157 160  57 112  92   6   1  19  84 167  39
  95  16 103 169  88  85   2 162  10   0  29  41  12   5  34 171  38 170
 156  30 115  47  21  43  14   4 118 173  99 166  11 153  42   9 165 106
   8  56  35  46 144  91 164 134 168 100  76  97  87  94 122  80 143   7
  20  45 131  15 120 161 163 110  62  86  90  61 141  66 121 105 152  79
 154 146  73  64  54 142  49 148  65  70 109  32  71 111 139  53 129  59
 138  28  77 149  31  52 132 125  50 108 147  60  25  63  55 136 124 155
  69 135 128 145  33 107  23  74 126 113  27  48  78 133 127 117  51  75
 140  68 151  72 119 123 114  67  26 137  58  24]

In [20]:
X = salary.drop(['Salary'],axis=1)

In [21]:
y = salary['Salary']

In [22]:
X

      Age  Gender  Education Level  Job Title  Years of Experience
0    32.0       1                0        159                  5.0
1    28.0       0                1         17                  3.0
2    45.0       1                2        130                 15.0
3    36.0       0                0        101                  7.0
4    52.0       1                1         22                 20.0
..    ...     ...              ...        ...                  ...
370  35.0       0                0        131                  8.0
371  43.0       1                1         30                 19.0
372  29.0       0                0         70                  2.0
373  34.0       1                0        137                  7.0
374  44.0       0                2        110                 15.0

[373 rows x 5 columns]

In [23]:
y

0       90000.0
1       65000.0
2      150000.0
3       60000.0
4      200000.0
         ...
370     85000.0
371    170000.0
372     40000.0
373     90000.0
374    150000.0
Name: Salary, Length: 373, dtype: float64

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.4, random_state=101)

In [26]:
X_train

      Age  Gender  Education Level  Job Title  Years of Experience
256  34.0       0                1        117                  6.0
135  39.0       0                0          2                 10.0
273  47.0       0                1         29                 20.0
83   52.0       1                2          8                 24.0
248  41.0       0                0        143                 11.0
..    ...     ...              ...        ...                  ...
63   47.0       1                2        115                 21.0
328  38.0       0                0        110                 10.0
339  33.0       1                0         65                  5.0
11   48.0       0                0         40                 18.0
353  48.0       1                1         29                 21.0

[223 rows x 5 columns]

In [27]:
X_test

      Age  Gender  Education Level  Job Title  Years of Experience
169  34.0       1                1        153                  9.0
38   26.0       0                0         16                  1.0
89   31.0       0                0         82                  6.0
168  31.0       0                0         60                  4.0
235  32.0       1                0         73                  3.0
..    ...     ...              ...        ...                  ...
20   34.0       0                1          3                  5.0
119  35.0       1                1        141                 10.0
167  46.0       1                2        147                 18.0
323  47.0       1                2         24                 20.0
362  44.0       0                2        110                 15.0

[150 rows x 5 columns]

In [28]:
y_train

256    100000.0
135     55000.0
273    180000.0
83     250000.0
248     95000.0
         ...
63     180000.0
328    110000.0
339     70000.0
11     140000.0
353    180000.0
Name: Salary, Length: 223, dtype: float64

In [29]:
y_test

169    105000.0
38      40000.0
89      55000.0
168     50000.0
235     45000.0
         ...
20      80000.0
119    120000.0
167    150000.0
323    180000.0
362    150000.0
Name: Salary, Length: 150, dtype: float64

In [30]:
from sklearn.linear_model import LinearRegression

In [31]:
lm = LinearRegression()

In [32]:
lm.fit(X_train,y_train)

LinearRegression()

In [33]:
lm.score(X_test, y_test)

0.9137641579426444

In [34]:
print("Model Score", lm.score(X_test, y_test)*100)

Model Score 91.37641579426445

### GRADIO GUI

In [35]:
import gradio as gr

salary=pd.read_csv("salary_data.csv")
# Define the input and output interfaces
inputs = [
    gr.inputs.Number(label="Age"),
    gr.inputs.Radio(['Male', 'Female'], label="Gender"),
    gr.inputs.Dropdown(list(salary['Education Level'].unique()), label="Education Level"),
    gr.inputs.Dropdown(list(salary['Job Title'].unique()), label="Job Title"),
    gr.inputs.Number(label="Years of Experience")
]

output = gr.outputs.Textbox(label="Salary")

# Define the predict function
def predict_salary(age, gender, education, job, experience):
    # Encode the categorical variables
    gender = 0 if gender == 'Male' else 1
    education = list(salary['Education Level'].unique()).index(education)
    job = list(salary['Job Title'].unique()).index(job)
    
    # Make the prediction
    prediction = lm.predict([[age, gender, education, job, experience]])
    
    # Return the prediction
    return f"{round(prediction[0], 2):,}"

# Create the Gradio interface
gr.Interface(predict_salary, inputs, output, title="Salary Predictor", description='Predict the salary based on Gender, Age, Education Level, and Job Title.').launch()

C:\Users\imaye\anaconda3\lib\site-packages\gradio\inputs.py:59: UserWarning: Usage of gradio.inputs is deprecated, and will not be supported in the future, please import your component from gradio.components
  warnings.warn(
C:\Users\imaye\anaconda3\lib\site-packages\gradio\deprecation.py:40: UserWarning: `optional` parameter is deprecated, and it has no effect
  warnings.warn(value)
C:\Users\imaye\anaconda3\lib\site-packages\gradio\inputs.py:183: UserWarning: Usage of gradio.inputs is deprecated, and will not be supported in the future, please import your component from gradio.components
  warnings.warn(
C:\Users\imaye\anaconda3\lib\site-packages\gradio\inputs.py:217: UserWarning: Usage of gradio.inputs is deprecated, and will not be supported in the future, please import your component from gradio.components
  warnings.warn(
C:\Users\imaye\anaconda3\lib\site-packages\gradio\outputs.py:22: UserWarning: Usage of gradio.outputs is deprecated, and will not be supported in the future, please import your components from gradio.components
  warnings.warn(

Running on local URL:  http://127.0.0.1:7860

To create a public link, set `share=True` in `launch()`.